#include <stdio.h>
#include <stdlib.h>
//数据的存储的学习
//C语言的数据类型分为 1.内置类型  2.自定义类型（1.数组类型2.结构体类型3.枚举类型4.联合类型）3.指针类型4.空类型（void（））
//类型的意义
//1.使用这个类型所占的空间的大小 2.类型决定如何看待内存空间的视角（int和float都存10存入的方式不一样）
//int main()
//{
//    int a = 0;//申请4个字节
//    float f = 10.0;
//    return 0;
//}
int main()
{
    int a  = 20;
    //00000000000000000000000000000010100
    //00000000000000000000000000000010100
    //00000000000000000000000000000010100
    int b = -10;
    //10000000000000000000000000000001010
    //11111111111111111111111111111110101符号位不变其他求反
    //11111111111111111111111111111111110反码加1得到补码
}
